Attribute VB_Name = "Module1"
'*****************************************************
'*** Loan_Calc():ローン返済額一括算出処理関数  ***
'*****************************************************
Sub Loan_Calc()

'パターン1算出
Range("B10") = "=B4-B5" '借入額
Range("B13") = "=ABS(PMT(B8/12, B7*12, B10-B11))" '毎月の返済額
Range("B14") = "=ABS(PMT(B8/2,B7*2,B11))" 'ボーナス時返済額
Range("B16") = "=((B13*12)+(B14*2))*B7" 'ローン支払総額
Range("B17") = "=B16-B10" 'ローン支払と実費との差額

'パターン2算出
Range("B26") = "=B20-B21" '借入額
Range("B29") = "=ABS(PMT(B24/12, B23*12, B26-B27))"  '毎月の返済額
Range("B30") = "=ABS(PMT(B24/2,B23*2,B27))"  'ボーナス時返済額
Range("B32") = "=((B29*12)+(B30*2))*B23" 'ローン支払総額
Range("B33") = "=B32-B26" 'ローン支払と実費との差額

'パターン3算出
Range("E10") = "=E4-E5" '借入額
Range("E13") = "=ABS(PMT(E8/12, E7*12, E10-E11))" '毎月の返済額
Range("E14") = "=ABS(PMT(E8/2,E7*2,E11))" 'ボーナス時返済額
Range("E16") = "=((E13*12)+(E14*2))*E7" 'ローン支払総額
Range("E17") = "=E16-E10" 'ローン支払と実費との差額

'パターン4算出
Range("E26") = "=E20-E21"  '借入額
Range("E29") = "=ABS(PMT(E24/12, E23*12, E26-E27))" '毎月の返済額
Range("E30") = "=ABS(PMT(E24/2,E23*2,E27))" 'ボーナス時返済額
Range("E32") = "=((E29*12)+(E30*2))*E23" 'ローン支払総額
Range("E33") = "=E32-E26" 'ローン支払と実費との差額

'パターン5算出
Range("H26") = "=H20-H21" '借入額
Range("H29") = "=ABS(PMT(H24/12, H23*12, H26-H27))" '毎月の返済額
Range("H30") = "=ABS(PMT(H24/2,H23*2,H27))" 'ボーナス時返済額
Range("H32") = "=((H29*12)+(H30*2))*H23" 'ローン支払総額
Range("H33") = "=H32-H26" 'ローン支払と実費との差額

'前回車ローン比較
Range("H10") = "=H4-H5" '借入額
Range("H13") = "=ABS(PMT(H8/12, H7*12, H10-H11))" '毎月の返済額
Range("H14") = "=ABS(PMT(H8/2,H7*2,H11))" 'ボーナス時返済額
Range("H16") = "=((H13*12)+(H14*2))*E7" 'ローン支払総額
Range("H17") = "=H16-H10" 'ローン支払と実費との差額

End Sub
